//=============================================================================
//
// メイン処理 [main.h]
// Author : Satoru Uchiyama
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include <windows.h>
#include "d3dx9.h"
#define DIRECTINPUT_VERSION (0x0800)
#include "dinput.h"
#include "xaudio2.h"					//サウンド処理で必要


//=============================================================================
// ライブラリファイルのリンク
//=============================================================================
#pragma comment (lib,"d3d9.lib")
#pragma comment (lib,"d3dx9.lib")
#pragma comment (lib,"dxguid.lib")
#pragma comment (lib,"winmm.lib")
#pragma comment (lib,"dinput8.lib")
//#include "input.h"

//=============================================================================
//ヘッダー読み込み
//=============================================================================
#include "xaudio2.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define SCREEN_WIDTH	(1280)													// ウインドウの幅
#define SCREEN_HEIGHT	(720)													// ウインドウの高さ
#define FVF_VERTEX_2D	(D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)
#define MAX_MODEL		(1500)													//Modelの最大数
#define MAX_PRIORITY_2		(8)													//Modelの最大数

//Playerのマクロ
#define		MAX_SPEED			(1.3f)											//プレイヤーのスピード
#define		MAX_INERTIAL		(0.3f)											//慣性の強さ

#define		MAX_SPEED_ENEMY			(1.5f)										//スピード
#define		MAX_INERTIAL_ENEMY		(0.5f)										//慣性の強さ
//背景用　デバック
#define		MAX_SPEED_BG			(0.05f)										//プレイヤーのスピード
#define		MAX_INERTIAL_BG		(0.005f)										//慣性の強さ
//Bulletのマクロ
#define MAX_BULLET_LIFE				(50)										//弾の寿命

class CRenderer;
class CScene;
class CScene2d;
//=============================================================================
//	プロトタイプ宣言
//=============================================================================
int GetFps(void);

//=============================================================================
// 構造体定義
//=============================================================================
typedef struct
{
	//座標
	D3DXVECTOR3 pos;
	//
	float rhw;
	//色
	D3DCOLOR col;
	//テクスチャ
	D3DXVECTOR2 tex;
}VERTEX_2D;

#endif
